app/controllers/api/v1/activities_controller.rb

SELECT "activities".* FROM "activities"
---
    def index
        activities = Activity.all

INSERT INTO "activities" ("name", "description", "user_id", "created_at", "updated_at", "latitude", "longitude", "address") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        activity = Activity.create(activity_params)

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 155], ["LIMIT", 1]]
UPDATE "activities" SET "description" = $1, "updated_at" = $2 WHERE "activities"."id" = $3  [["description", "Change from 3v3 to 5v5"], ["updated_at", "2019-10-24 22:13:26.378603"], ["id", 221]]
---
    def update
        activity = Activity.find_by(id: params[:id])
        if activity.update(activity_params)

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 415], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 415]]
---
    def destroy
        activity = Activity.find_by(id: params[:id])
        #byebug
        if activity.destroy