app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Charlie Gibson"], ["LIMIT", 1]]
---
    def create
        @user = User.find_by(username: user_login_params[:username])