app/controllers/api/v1/participations_controller.rb

    def index
        participations = Participation.all
---
SELECT "participations".* FROM "participations"

    def create
        participation = Participation.create(participation_params)
---
INSERT INTO "participations" ("activity_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["activity_id", 734], ["user_id", 1421], ["created_at", "2019-11-05 00:09:51.360524"], ["updated_at", "2019-11-05 00:09:51.360524"]]

    def destroy

        participation = Participation.find_by(id: params[:id])
        #participation.destroy
        if participation.destroy
---
SELECT  "participations".* FROM "participations" WHERE "participations"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "participations" WHERE "participations"."id" = $1  [["id", 8]]