app/controllers/api/v1/users_controller.rb

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("last_name", "username", "password_digest", "email", "created_at", "updated_at", "first_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"